@extends ('templates.all')
@push('css')
    <link rel="stylesheet" href="information.css">
@endpush
@section('content')

<div class="scroll">

<div class="info">
    <div class="tag1">
        <p class="name1">Про нас</p>
        <div class="line1"></div>
    </div>
    <div class="infobutt">
        <div class="info1">
            <div class="texti">
                <p>Кондитерська Б.Бучераті надає послуги доставки як безпосередньо закладом, за умови
                    доставки у межах області, так і у співпраці з поштовою службою Укрпошта при доставці в
                    інші міста по Україні. </p>
                <p>Також при замовленні солодощів на сайті можна забрати товар самостійно за умови наявності
                    номеру замовлення.
                    В кожному закладі наявні сидячі місця та столики для відвідувачів.</p>
            </div>
        </div>

    </div>
    <div class="catbutt">
        <div class="cor">
            <div class="t">
                <svg xmlns="http://www.w3.org/2000/svg" width=60% height=60% viewBox="0 0 512 512">
                    <path fill="#503d3f"
                        d="M256.18 21c-23.242 0-46.577 3.01-63.186 8.54c-8.304 2.763-14.868 6.196-18.808 9.558c-3.94 3.36-5.167 5.956-5.186 8.96L168.943 57H41v14h430V57H342.967l.033-9.033c.01-3.002-1.17-5.55-5.057-8.895c-3.887-3.344-10.407-6.773-18.677-9.535C302.724 24.014 279.42 21 256.18 21zM38.277 89l-10.443 94h80.9l20.243-86.36L122.81 183h81.07l17.114-86.68l-3.096 86.68h75.75l-4.634-86.518L307.694 183h81.497l-6.167-86.36L403.266 183h80.9l-10.443-94H38.277zM25.834 201l-.51 4.588C39.822 226.445 52.968 235 64 235c11.32 0 24.852-8.89 39.8-30.96l.714-3.04h-78.68zm95.687 0l-.32 4.498C135.753 226.495 148.935 235 160 235c11.293 0 24.788-8.85 39.693-30.803l.63-3.197h-78.802zm95.736 0l-.156 4.352C231.69 226.455 244.908 235 256 235c11.08 0 24.28-8.525 38.85-29.576l-.237-4.424h-77.357zm94.324 0l.674 3.12c15 22.192 28.503 31.044 39.773 31.013c11.03-.03 24.212-8.62 38.772-29.637l-.32-4.496h-78.9zm95.906 0l.713 3.04C423.147 226.11 436.68 235 448 235c11.032 0 24.178-8.555 38.676-29.412l-.51-4.588h-78.68zM112 223.31C97.313 242.11 81.492 253 64 253c-13.972 0-26.884-6.906-39-19.264V487h318V279h114v208h30V233.736C474.884 246.094 461.972 253 448 253c-17.49 0-33.31-10.888-47.996-29.684c-14.664 18.808-30.432 29.77-47.926 29.817c-17.508.048-33.352-10.87-48.092-29.807C289.303 242.116 273.486 253 256 253c-17.492 0-33.313-10.89-48-29.69c-14.687 18.8-30.508 29.69-48 29.69s-33.313-10.89-48-29.69zM55 279h258v178H55V279zm18 18v142h222V297H73zm288 0v71.064l78 .573V297h-78zM88 312h128c-108.235 8-116.31 24-128 113.11V312zm273 74.066v13.998l78 .573v-14.002l-78-.57zm0 32V487h78v-68.365l-78-.57z" />
                </svg>
            </div>
            <p>Самовивіз</p>
            <div class="det1">
                <p class="det">Детальніше</p>
                <div class="line2"></div>
            </div>
        </div>
        <div class="cor">
            <div class="t">
                <svg xmlns="http://www.w3.org/2000/svg" width=60% height=60% viewBox="0 0 24 24">
                    <path fill="#503d3f"
                        d="M3 13.5L2.25 12H7.5l-.6-1.5H2L1.25 9h7.8l-.6-1.5H1.11L.25 6H4a2 2 0 0 1 2-2h12v4h3l3 4v5h-2a3 3 0 0 1-3 3a3 3 0 0 1-3-3h-4a3 3 0 0 1-3 3a3 3 0 0 1-3-3H4v-3.5H3m16 5a1.5 1.5 0 0 0 1.5-1.5a1.5 1.5 0 0 0-1.5-1.5a1.5 1.5 0 0 0-1.5 1.5a1.5 1.5 0 0 0 1.5 1.5m1.5-9H18V12h4.46L20.5 9.5M9 18.5a1.5 1.5 0 0 0 1.5-1.5A1.5 1.5 0 0 0 9 15.5A1.5 1.5 0 0 0 7.5 17A1.5 1.5 0 0 0 9 18.5Z" />
                </svg>
            </div>
            <p>Кур'єр</p>
            <div class="det1">
                <p class="det">Детальніше</p>
                <div class="line2"></div>
            </div>
        </div>
        <div class="cor">
            <div class="t">
                <img class="ukrposhta" src="ukr.png" alt="ukrposhta logo">
            </div>
            <p>Укрпошта</p>
            <div class="det1">
                <p class="det">Детальніше</p>
                <div class="line2"></div>
            </div>
        </div>
        <div class='cor'>
            <div class="t">
                <svg xmlns="http://www.w3.org/2000/svg" width=60% height=60% viewBox="0 0 24 24">
                    <path fill="#503d3f"
                        d="M21 11.11V5a2 2 0 0 0-2-2h-4.18C14.4 1.84 13.3 1 12 1s-2.4.84-2.82 2H5c-1.1 0-2 .9-2 2v14a2 2 0 0 0 2 2h6.11c1.26 1.24 2.98 2 4.89 2c3.87 0 7-3.13 7-7c0-1.91-.76-3.63-2-4.89M12 3c.55 0 1 .45 1 1s-.45 1-1 1s-1-.45-1-1s.45-1 1-1M5 19V5h2v2h10V5h2v4.68c-.91-.43-1.92-.68-3-.68H7v2h4.1c-.6.57-1.06 1.25-1.42 2H7v2h2.08c-.05.33-.08.66-.08 1c0 1.08.25 2.09.68 3H5m11 2c-2.76 0-5-2.24-5-5s2.24-5 5-5s5 2.24 5 5s-2.24 5-5 5m.5-4.75l2.86 1.69l-.75 1.22L15 17v-5h1.5v4.25Z" />
                </svg>
            </div>
            <p>Термінова</p>
            <div class="det1">
                <p class="det">Детальніше</p>
                <div class="line2"></div>
            </div>
        </div>
    </div>
</div>

<div class="info2">
    <div class="tag1">
        <p class="name1">Умови доставки</p>
        <p class="name1">та оплати</p>
        <div class="line1"></div>
    </div>
    <div class="infobutt">
        <div class="info1">
            <div class="texti">
                <ul class="list">
                    <li>Оформити замовлення можливо в будь який зручний час.</li>
                    <li>Замовлення опрацьовуються в будні дні з 08:00 до 20:00, у вихідні дні з 10:00 до
                        18:00.</li>
                    <li>В святкові та в передсвяткові дні опрацювання та доставка замовлень може
                        затримуватись.</li>
                    <li>Мінімальна сума замовлення для доставки 200.</li>
                    <li>Кількість акційних позицій обмежена для замовлення.</li>
                    <li>Продукція належної якості обміну та поверненню не підлягає, згідно Постанови КМУ №
                        172 від 19.03.94 р. «Про реалізацію окремих положень ЗУ «Про захист прав
                        споживачів».</li>
                    <li>Оформлюючи замовлення для іншої особи обов’язково вказуйте ПІБ і контактний номер
                        телефона отримувача.</li>
                </ul>
            </div>
        </div>
    </div>
</div>

<div class="info3">
    <div class="tag1">
        <p class="name1">Оплата</p>
        <div class="line1"></div>
    </div>
    <div class="infobutt">
        <div class="info1">
            <div class="texti">
                <ul class="list">
                    <li>Готівковий розрахунок: для замолвень до 300 гривень можлива готівкова післяплата при
                        отриманні. Для замовлень від 300-500 гривень передплата 50%. Для замовлень більшої
                        цінової категорії передоплат в розмірі 100% вартості замовлення.</li>
                    <li>Банківською карткою Visa/Mastercard: оплатити замовлення онлайн можна за допомогою
                        банківської карти Visa і Mastercard випущені на території України.</li>
                    <li>При оплаті замовлення online банківська картка авторизуєтся на сайті та відбувається
                        HOLD (попереднє утримання) суми Вашим банком. Після коригування замовлення в
                        магазині (коригування ваги, кількість пакетів для пакування та ін.), відбувається
                        остаточне списання суми коштів згідно чеку. Різниця між сумою HOLD та остаточним
                        списанням буде повернута Вашим банком найближчим часом, відповідно до умов
                        повернення коштів Вашим банком.</li>
                    <li>Зверніть увагу, що отримати товар, оплачений платіжною карткою, може тільки той
                        клієнт, чиї ПІБ були вказані на сайті при оформленні замовлення. Доставка товару
                        можлива тільки після підтвердження платежу.</li>
                </ul>
            </div>
        </div>
    </div>
</div>

</div>
@endsection