@extends ('templates.all')
@push('css')
    <link rel="stylesheet" href="/main.css">
@endpush
@section('content')
<div class="center">
            <div class="notpic">
                <div class="textp">
                    <p class="firstt">Створіть свої унікальні солодощі</p>
                    <p class="secondt">Створіть свої унікальні солодощі та набори в конструкторі</p>
                </div>
                <div class="butt5"><a
                        href="/catalog">
                        <p>конструктор</p>
                    </a></div>
            </div>
            <div class="pic">
                <img class="cpic" src="image.jpg" alt="chocolate">
            </div>
        </div>
        <div class="scroll">
            <div class="catalog">
                <div class="tag1">
                    <a href="/catalog">
                        <p class="name1">Каталог</p></a>
                    <div class="line1"></div>
                </div>
                <div class="catbutt">
                    <div class="cor">
                        <a href="/catalog/1">
                        <div class="t">
                            <svg xmlns="http://www.w3.org/2000/svg" width=50% height=50% viewBox="0 0 32 32">
                                <g transform="rotate(90 16 16)">
                                    <path fill="#503d3f"
                                        d="M11 2c1.1 0 2 .9 2 2v2.458A9.996 9.996 0 0 1 16 6c5.523 0 10 4.477 10 10a9.98 9.98 0 0 1-.458 3H28c1.1 0 2 .9 2 2s-.9 2-2 2c-.8 0-1.2.97-.63 1.53l.05.05c.78.78.78 2.05 0 2.83c-.78.78-2.05.78-2.83 0l-.05-.05C23.97 26.8 23 27.2 23 28c0 1.1-.9 2-2 2s-2-.9-2-2v-2.458A9.997 9.997 0 0 1 16 26c-5.523 0-10-4.477-10-10c0-1.045.16-2.053.458-3H4c-1.1 0-2-.9-2-2s.9-2 2-2c.8 0 1.2-.97.63-1.53l-.05-.05c-.78-.78-.78-2.05 0-2.83c.78-.78 2.05-.78 2.83 0l.05.05C8.03 5.2 9 4.8 9 4c0-1.1.9-2 2-2Zm13 14v-.03a6.782 6.782 0 0 0-1.91-.265c-1.76 0-3.49.71-4.76 2.13A6.41 6.41 0 0 0 15.96 24H16a7.98 7.98 0 0 0 3-.581V22.5c0-1.93 1.57-3.5 3.5-3.5h.919A7.98 7.98 0 0 0 24 16Zm-.484-2.746a7.998 7.998 0 0 0-1.61-2.65a9.322 9.322 0 0 0-2.246-.274c-2.57 0-5.13 1.06-6.97 3.13a9.35 9.35 0 0 0-2.09 8.442a7.999 7.999 0 0 0 2.638 1.608a6.269 6.269 0 0 1-.127-.919c-.07-1.16.123-2.372.493-3.462c.39-1.13.988-2.1 1.788-3a9.036 9.036 0 0 1 6.698-3.02c.482 0 .958.055 1.426.145ZM16 8a8 8 0 0 0-7.95 8.9c.086-.364.19-.724.31-1.08c.52-1.51 1.32-2.89 2.39-4.09a11.804 11.804 0 0 1 6.178-3.677A8.084 8.084 0 0 0 16 8Z" />
                                </g>
                            </svg>
                        </div>
                        <p>цукерки</p>
                        </a>
                    </div>
                    <div class="cor">
                    <a href="/catalog/2">
                        <div class="t">
                            <svg xmlns="http://www.w3.org/2000/svg" width=50% height=50% viewBox="0 0 32 32">
                                <g transform="rotate(90 16 16)">
                                    <g fill="#503d3f">
                                        <path
                                            d="m9.622 7.763l3.21-3.21l3.21 3.21l-3.21 3.21l-3.21-3.21Zm-1.86 8.28l-3.21-3.21l3.21-3.21l3.21 3.21l-3.21 3.21Z" />
                                        <path
                                            d="m13.822 2.413l7.527 7.536l.08-.08a.856.856 0 0 1 1.184-.013l.006.006l.867.867c.305.305.315.77.083 1.094l-.004.007l-.143.192l6.16 6.16c.55.55.55 1.43 0 1.98l-9.43 9.43c-.55.55-1.43.55-1.98 0l-4.447-4.447a.842.842 0 0 1-1.256.071l-2.6-2.6a.856.856 0 0 1-.013-1.184l.006-.007l.077-.076l-7.527-7.527c-.55-.55-.55-1.43 0-1.98l9.43-9.43c.55-.55 1.43-.55 1.98 0Zm6.582 8.48l-1.756-1.755a.592.592 0 0 0-.85 0l-3.58 3.58a.606.606 0 0 0 0 .86l1.749 1.749l.61-.61l-1.565-1.565l3.21-3.22l1.569 1.574l.613-.613Zm-5.076 5.072l-1.754-1.754a.592.592 0 0 0-.85 0l-3.58 3.58l-.005.005l-.005.005c-.24.23-.24.61 0 .85l1.752 1.752l.616-.616l-1.57-1.564l3.22-3.21l1.564 1.563l.612-.61ZM8.822 8.193l3.58 3.58c.24.24.62.24.85-.01l3.58-3.58a.58.58 0 0 0 .18-.42h.01c0-.15-.06-.31-.18-.43l-3.58-3.58a.605.605 0 0 0-.86 0l-3.58 3.59c-.24.23-.24.61 0 .85Zm-5.07 5.07l3.58 3.58c.24.24.62.24.85 0l3.58-3.58a.58.58 0 0 0 .18-.43h.01c0-.16-.06-.31-.18-.43l-3.58-3.58a.592.592 0 0 0-.85 0l-3.59 3.59c-.24.23-.24.61 0 .85Zm6.933 8.754l2.362 2.363l9.636-13.04l-.655-.655l-11.343 11.332Z" />
                                    </g>
                                </g>
                            </svg>
                        </div>
                        <p>тафлі</p>
                    </a>
                    </div>
                    <div class="cor">
                    <a href="/catalog/3">
                        <div class="t">
                            <svg xmlns="http://www.w3.org/2000/svg" width=50% height=50% viewBox="0 0 12 12">
                                <path fill="#503d3f"
                                    d="M6.003 1c-.534 0-.88.357-1.065.65a2.015 2.015 0 0 0-.303.884c-.025.424.04.842.303 1.158c.275.33.672.438 1.065.438c.403 0 .797-.123 1.068-.45c.261-.316.332-.731.303-1.152a2.06 2.06 0 0 0-.304-.869C6.888 1.369 6.543 1 6.003 1Zm-.37 1.592c.004-.063.05-.248.15-.409c.103-.162.182-.183.22-.183c.032 0 .113.02.22.19c.103.166.15.353.153.408c.02.284-.04.402-.075.444c-.025.03-.092.088-.298.088c-.222 0-.28-.058-.297-.078c-.028-.034-.091-.15-.073-.46ZM10 10V6.5A1.5 1.5 0 0 0 8.5 5h-5A1.5 1.5 0 0 0 2 6.5V10h-.5a.5.5 0 0 0 0 1h9a.5.5 0 0 0 0-1H10ZM3.5 6h5a.5.5 0 0 1 .5.5v.786l-.867.676a.25.25 0 0 1-.299.006l-1.109-.79a1.25 1.25 0 0 0-1.45 0l-1.11.79a.25.25 0 0 1-.299-.006L3 7.286V6.5a.5.5 0 0 1 .5-.5ZM3 8.554l.251.196a1.25 1.25 0 0 0 1.494.033l1.11-.79a.25.25 0 0 1 .29 0l1.11.79a1.25 1.25 0 0 0 1.493-.033L9 8.554V10H3V8.554Z" />
                            </svg>
                        </div>
                        <p>торти</p>
                    </a>
                    </div>
                    <div class='cor'>
                        <a href="/catalog/4">
                        <div class="t">
                            <svg xmlns="http://www.w3.org/2000/svg" width=50% height=50% viewBox="0 0 24 24">
                                <path fill="#503d3f"
                                    d="M15.5 2a3.5 3.5 0 0 1 3.437 4.163l-.015.066a4.502 4.502 0 0 1 .303 8.428l-1.086 6.507a1 1 0 0 1-.986.836H6.847a1 1 0 0 1-.986-.836l-1.029-6.17a3 3 0 0 1-.829-5.824L4 9a6 6 0 0 1 8.575-5.42A3.493 3.493 0 0 1 15.5 2zM11 15H9v5h2v-5zm4 0h-2v5h2v-5zm2.5-2a2.5 2.5 0 1 0-.956-4.81l-.175.081a2 2 0 0 1-2.663-.804l-.07-.137A4 4 0 0 0 10 5C7.858 5 6.109 6.684 6.005 8.767L6 8.964l.003.17a2 2 0 0 1-1.186 1.863l-.15.059A1.001 1.001 0 0 0 5 13h12.5z" />
                            </svg>
                        </div>
                        <p>інші вироби</p>
                    </a>
                    </div>
                </div>
            </div>

            <div class="pop">
                <div class="tag1">
                    <p class="name1">Популярне</p>
                    <div class="line1"></div>
                </div>
                <div class="catbutt">
                    @foreach($firmovi as $x)
                    <div class="cor1">
                        <div class="t1">
                            <img class="donut" src="{{$x->image}}" alt="{{$x->name}}">
                        </div>
                        <a
                            href="/tovar/{{$x->id}}">
                            <p>{{$x->name}}</p>
                        </a>
                        @if($x->weight_id == 1)
                        <p class="price">{{$x->price}}грн/1{{$x->weight->name}}</p>
                        @elseif($x->weight_id == 2)
                        <p class="price">{{$x->price}}грн/100{{$x->weight->name}}</p>
                        @endif
                        <div class="butt1">
                            @if($x->weight_id == 1)
                            <p> 1 </p>
                            @elseif($x->weight_id == 2)
                            <p>100</p>
                            @endif
                            <div class="kosh">
                            <a href="/main/{{$x->id}}">
                                <svg xmlns="http://www.w3.org/2000/svg" width=53% height=53% viewBox="0 0 24 24">
                                    <g fill="none" fill-rule="evenodd">
                                        <path
                                            d="M24 0v24H0V0h24ZM12.593 23.258l-.011.002l-.071.035l-.02.004l-.014-.004l-.071-.035c-.01-.004-.019-.001-.024.005l-.004.01l-.017.428l.005.02l.01.013l.104.074l.015.004l.012-.004l.104-.074l.012-.016l.004-.017l-.017-.427c-.002-.01-.009-.017-.017-.018Zm.265-.113l-.013.002l-.185.093l-.01.01l-.003.011l.018.43l.005.012l.008.007l.201.093c.012.004.023 0 .029-.008l.004-.014l-.034-.614c-.003-.012-.01-.02-.02-.022Zm-.715.002a.023.023 0 0 0-.027.006l-.006.014l-.034.614c0 .012.007.02.017.024l.015-.002l.201-.093l.01-.008l.004-.011l.017-.43l-.003-.012l-.01-.01l-.184-.092Z" />
                                        <path fill="#d6cbc1"
                                            d="M10.464 3.282a2 2 0 0 1 2.964-.12l.108.12L17.468 8h2.985a1.49 1.49 0 0 1 1.484 1.655l-.092.766l-.1.74l-.082.554l-.095.595l-.108.625l-.122.648l-.136.661c-.072.333-.149.667-.232.998a21.018 21.018 0 0 1-.832 2.584l-.221.54l-.214.488l-.202.434l-.094.194l-.249.49c-.32.61-.924.97-1.563 1.022l-.16.006H6.555a1.929 1.929 0 0 1-1.71-1.008l-.232-.45l-.18-.37a20.09 20.09 0 0 1-.095-.205l-.2-.449a21.536 21.536 0 0 1-1.108-3.276a32.366 32.366 0 0 1-.156-.654l-.142-.648l-.127-.634l-.112-.613l-.1-.587l-.087-.554l-.074-.513l-.09-.683l-.066-.556a39.802 39.802 0 0 1-.017-.153a1.488 1.488 0 0 1 1.348-1.64L3.543 8h2.989l3.932-4.718Zm-.503 9.44a1 1 0 0 0-1.96.326l.013.116l.5 3l.025.114a1 1 0 0 0 1.96-.326l-.013-.116l-.5-3l-.025-.114Zm5.203-.708a1 1 0 0 0-1.125.708l-.025.114l-.5 3a1 1 0 0 0 1.947.442l.025-.114l.5-3a1 1 0 0 0-.822-1.15ZM12 4.562L9.135 8h5.73L12 4.562Z" />
                                    </g>
                                </svg>
</a>
                            </div>
                        </div>
                    </div>
                    @endforeach
                </div>
            </div>
            @if($popular)
            <div class="firm">
                <div class="tag1">
                    <p class="name1">Фірмові солодощі</p>
                    <div class="line1"></div>
                </div>
                <div class="catbutt">
                    @foreach($popular as $x)
                    <div class="cor1">
                        <div class="t2">
                            <img class="donut1" src="{{$x->image}}" alt="{{$x->name}}">
                        </div>
                        <a
                            href="/tovar/{{$x->id}}">
                            <p>{{$x->name}}</p>
                        </a>
                        @if($x->weight_id == 1)
                        <p class="price">{{$x->price}}грн/1{{$x->weight->name}}</p>
                        @elseif($x->weight_id == 2)
                        <p class="price">{{$x->price}}грн/100{{$x->weight->name}}</p>
                        @endif
                        <div class="butt1">
                            @if($x->weight_id == 1)
                            <p> 1 </p>
                            @elseif($x->weight_id == 2)
                            <p>100</p>
                            @endif
                            <a href="/main/{{$x->id}}">
                            <div class="kosh">
                                <svg xmlns="http://www.w3.org/2000/svg" width=53% height=53% viewBox="0 0 24 24">
                                    <g fill="none" fill-rule="evenodd">
                                        <path
                                            d="M24 0v24H0V0h24ZM12.593 23.258l-.011.002l-.071.035l-.02.004l-.014-.004l-.071-.035c-.01-.004-.019-.001-.024.005l-.004.01l-.017.428l.005.02l.01.013l.104.074l.015.004l.012-.004l.104-.074l.012-.016l.004-.017l-.017-.427c-.002-.01-.009-.017-.017-.018Zm.265-.113l-.013.002l-.185.093l-.01.01l-.003.011l.018.43l.005.012l.008.007l.201.093c.012.004.023 0 .029-.008l.004-.014l-.034-.614c-.003-.012-.01-.02-.02-.022Zm-.715.002a.023.023 0 0 0-.027.006l-.006.014l-.034.614c0 .012.007.02.017.024l.015-.002l.201-.093l.01-.008l.004-.011l.017-.43l-.003-.012l-.01-.01l-.184-.092Z" />
                                        <path fill="#d6cbc1"
                                            d="M10.464 3.282a2 2 0 0 1 2.964-.12l.108.12L17.468 8h2.985a1.49 1.49 0 0 1 1.484 1.655l-.092.766l-.1.74l-.082.554l-.095.595l-.108.625l-.122.648l-.136.661c-.072.333-.149.667-.232.998a21.018 21.018 0 0 1-.832 2.584l-.221.54l-.214.488l-.202.434l-.094.194l-.249.49c-.32.61-.924.97-1.563 1.022l-.16.006H6.555a1.929 1.929 0 0 1-1.71-1.008l-.232-.45l-.18-.37a20.09 20.09 0 0 1-.095-.205l-.2-.449a21.536 21.536 0 0 1-1.108-3.276a32.366 32.366 0 0 1-.156-.654l-.142-.648l-.127-.634l-.112-.613l-.1-.587l-.087-.554l-.074-.513l-.09-.683l-.066-.556a39.802 39.802 0 0 1-.017-.153a1.488 1.488 0 0 1 1.348-1.64L3.543 8h2.989l3.932-4.718Zm-.503 9.44a1 1 0 0 0-1.96.326l.013.116l.5 3l.025.114a1 1 0 0 0 1.96-.326l-.013-.116l-.5-3l-.025-.114Zm5.203-.708a1 1 0 0 0-1.125.708l-.025.114l-.5 3a1 1 0 0 0 1.947.442l.025-.114l.5-3a1 1 0 0 0-.822-1.15ZM12 4.562L9.135 8h5.73L12 4.562Z" />
                                    </g>
                                </svg>
                            </div>
</a>
                        </div>
                    </div>
                    @endforeach
                </div>
            </div>
            @endif
            <div class="konst">
                <div class="tag1">
                    <a
                        href="/catalog">
                        <p class="name1">Конструктор</p>
                    </a>
                    <div class="line1"></div>
                </div>
                <div class="konstbutt">
                    <div class="left">
                        <div class="textk">
                            <p>Зважаючи на те, що смаки наших відвідувачів дуже різні, ми надаємо змогу кожному скласти
                                той набір солодощів, який найбільше припав до смаку. Обирайте цукерки, тафлі, торти, та
                                навіть унікальні обгортки до них. Створюйте нові поєднання начинок і насолоджуйтесь
                                власним унікальним набором!</p>
                        </div>
                        <div class="buttk"><a
                                href="/catalog">
                                <p>конструктор</p>
                            </a></div>
                    </div>
                    <div class="kpic">
                        <img class="kpic1" src="https://www.thespruceeats.com/thmb/FhHcgQni8lgV0griUeDJMTAszxI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/chocolate_hero1-d62e5444a8734f8d8fe91f5631d51ca5.jpg" alt="donut">
                        <img class="kpic2" src="https://www.eltiempo.com/files/article_main_1200/uploads/2023/02/27/63fd2da25213c.jpeg" alt="donut">
                        <img class="kpic3" src="https://health.clevelandclinic.org/wp-content/uploads/sites/3/2015/03/chocolateWhiteDark-454384771-770x533-1-650x428.jpg" alt="donut">
                    </div>
                    
                </div>
            </div>

            <div class="info">
                <div class="tag1">
                    <a href="/information">
                    <p class="name1">Про нас</p></a>
                    <div class="line1"></div>
                </div>
                <div class="infobutt">
                    <div class="info1">
                        <div class="texti">
                            <p class="infotext">Кондитерська Б.Бучераті почалась з маленької крамнички невеликого
                                сімейного бізнесу.
                                Завдяки підтримці та задоволеним відвідувачам наша сім’я мала змогу розрозростись у щось
                                настільки велике, як ціла мережа крамничок по всій країні. Ми вдячні вам за кожну
                                придбану цукерку і сподіваємось, що продовжуватимемо радувати вас чимсь новим у
                                відповідь.</p>
                            <div class="pid">
                                <p class="love">З любов’ю Б.Бучераті та родина</p>
                                <svg xmlns="http://www.w3.org/2000/svg" width=7% height=7% viewBox="0 0 32 32">
                                    <g transform="rotate(90 16 16)">
                                        <g fill="#d6cbc1">
                                            <path
                                                d="m9.622 7.763l3.21-3.21l3.21 3.21l-3.21 3.21l-3.21-3.21Zm-1.86 8.28l-3.21-3.21l3.21-3.21l3.21 3.21l-3.21 3.21Z" />
                                            <path
                                                d="m13.822 2.413l7.527 7.536l.08-.08a.856.856 0 0 1 1.184-.013l.006.006l.867.867c.305.305.315.77.083 1.094l-.004.007l-.143.192l6.16 6.16c.55.55.55 1.43 0 1.98l-9.43 9.43c-.55.55-1.43.55-1.98 0l-4.447-4.447a.842.842 0 0 1-1.256.071l-2.6-2.6a.856.856 0 0 1-.013-1.184l.006-.007l.077-.076l-7.527-7.527c-.55-.55-.55-1.43 0-1.98l9.43-9.43c.55-.55 1.43-.55 1.98 0Zm6.582 8.48l-1.756-1.755a.592.592 0 0 0-.85 0l-3.58 3.58a.606.606 0 0 0 0 .86l1.749 1.749l.61-.61l-1.565-1.565l3.21-3.22l1.569 1.574l.613-.613Zm-5.076 5.072l-1.754-1.754a.592.592 0 0 0-.85 0l-3.58 3.58l-.005.005l-.005.005c-.24.23-.24.61 0 .85l1.752 1.752l.616-.616l-1.57-1.564l3.22-3.21l1.564 1.563l.612-.61ZM8.822 8.193l3.58 3.58c.24.24.62.24.85-.01l3.58-3.58a.58.58 0 0 0 .18-.42h.01c0-.15-.06-.31-.18-.43l-3.58-3.58a.605.605 0 0 0-.86 0l-3.58 3.59c-.24.23-.24.61 0 .85Zm-5.07 5.07l3.58 3.58c.24.24.62.24.85 0l3.58-3.58a.58.58 0 0 0 .18-.43h.01c0-.16-.06-.31-.18-.43l-3.58-3.58a.592.592 0 0 0-.85 0l-3.59 3.59c-.24.23-.24.61 0 .85Zm6.933 8.754l2.362 2.363l9.636-13.04l-.655-.655l-11.343 11.332Z" />
                                        </g>
                                    </g>
                                </svg>
                            </div>
                        </div>
                    </div>
                    <div class="cake">
                        <img class="cakepic" src="cake.jpg" alt="cake">
                    </div>
                </div>
            </div>
        </div>
@endsection